# DividedSurfaceCurveChainMultipleSeqIntersWithDivLine Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DividedSurfaceFailures..::..DividedSurfaceCurveChainMultipleSeqIntersWithDivLine Property
BuiltInFailures..::..DividedSurfaceFailures Class See Also
---
The chain formed by these curve elements has multiple sequential intersections with a gridline and so the chain will be ignored
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DividedSurfaceCurveChainMultipleSeqIntersWithDivLine { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DividedSurfaceCurveChainMultipleSeqIntersWithDivLine As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DividedSurfaceCurveChainMultipleSeqIntersWithDivLine {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DividedSurfaceFailures Class
Autodesk.Revit.DB Namespace